# Pandas

Pandas is a tool or librasry  written on top of numpy.

-> to load data

-> prepare data

-> manipulate

->Analyis data

-> model data(ML model)

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\anshu\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\anshu\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\anshu\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\anshu\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\anshu\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\anshu\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [1]:
import pandas as pd
import numpy as np

# pandas Series data sturcture
its a data with index

Homogeneous

its 1D array

In [3]:
s=pd.Series([1.0,2,3,4])
s

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [4]:
s[2]

3.0

In [5]:
s[1:3]

1    2.0
2    3.0
dtype: float64

In [6]:
s=pd.Series(['a','b','kmn'])
s

0      a
1      b
2    kmn
dtype: object

In [7]:
s=pd.Series(['a','b',6,7.8])
s

0      a
1      b
2      6
3    7.8
dtype: object

### Creating numpy array  to pandas Series

In [8]:
arr=np.array([1,2,8,4])
print(arr)
s=pd.Series(arr)
print(s)

[1 2 8 4]
0    1
1    2
2    8
3    4
dtype: int32

### data Accessing using index of series

In [10]:
s=pd.Series([1,2,3,4,5])
print(s[2])
print(s[3:])
print(s[1:3])
print(s[[1,4]])

3
3    4
4    5
dtype: int64
1    2
2    3
dtype: int64
1    2
4    5
dtype: int64

In [16]:
s=pd.Series([91,72,83,74,55], index=['anshu','babu','ravi','raja','sima'])
print(s)
print(s['raja'])

anshu    91
babu     72
ravi     83
raja     74
sima     55
dtype: int64
74

In [17]:
print(s['babu':])

babu    72
ravi    83
raja    74
sima    55
dtype: int64

In [18]:
print(s['ravi':'sima'])

ravi    83
raja    74
sima    55
dtype: int64

In [19]:
print(s[['anshu','raja']])

anshu    91
raja     74
dtype: int64

# Pandas DataFrame
 
 data sturcture

its a data with index

hetrogeneous

its 2D array

## creating dataframe using dictionary

In [21]:
data={'Name':['anshu','babu','ravi','raja','sima'], 
    'Marks':[91,72,83,74,55]}
print(data)
df=pd.DataFrame(data)
df

{'Name': ['anshu', 'babu', 'ravi', 'raja', 'sima'], 'Marks': [91, 72, 83, 74, 55]}

    Name  Marks
0  anshu     91
1   babu     72
2   ravi     83
3   raja     74
4   sima     55

Create df with index

In [22]:
data={'Name':['anshu','babu','ravi','raja','sima'], 
    'Marks':[91,72,83,74,55]}
df=pd.DataFrame(data, index=['I1','I2','I3','I4','I5'])
df

     Name  Marks
I1  anshu     91
I2   babu     72
I3   ravi     83
I4   raja     74
I5   sima     55

In [24]:
df=pd.DataFrame({'Name':['anshu','babu','ravi','raja','sima'], 
    'Marks':[91,72,83,74,55],
    'Gender':['Female','Male','Male',np.nan,'Female']})
df

    Name  Marks  Gender
0  anshu     91  Female
1   babu     72    Male
2   ravi     83    Male
3   raja     74     NaN
4   sima     55  Female

# Dataframe using tupple

In [102]:
data=[('2023-09-01',25,10,'Sunny'),
      ('2023-09-02', 22, 15, 'Partly Cloudy'),
     ('2023-09-03', 28, 8, 'Rainy'),
     ('2023-09-06', 19, 5, 'Rainy'),
      ('2023-09-07', 27, 18, 'Thunderstorms'),
      ('2023-09-10', 29, 7, 'Sunny'),
      ('2023-09-09', 23, 14, 'Cloudy'),
      ('2023-09-11', 19, 5, 'Rainy')]
df=pd.DataFrame(data, columns=['Date','Temprature','Wind Speed','Event'])
df

         Date  Temprature  Wind Speed          Event
0  2023-09-01          25          10          Sunny
1  2023-09-02          22          15  Partly Cloudy
2  2023-09-03          28           8          Rainy
3  2023-09-06          19           5          Rainy
4  2023-09-07          27          18  Thunderstorms
5  2023-09-10          29           7          Sunny
6  2023-09-09          23          14         Cloudy
7  2023-09-11          19           5          Rainy

# DataFrame Functionalities

In [73]:
df.columns

Index(['Date', 'Temprature', 'Wind Speed', 'Event'], dtype='object')

In [74]:
df.T

,0,1,2,3,4,5,6,7
Date,2023-09-01,2023-09-02,2023-09-03,2023-09-06,2023-09-07,2023-09-10,2023-09-09,2023-09-11
Temprature,25,22,28,19,27,29,23,19
Wind Speed,10,15,8,5,18,7,14,5
Event,Sunny,Partly Cloudy,Rainy,Rainy,Thunderstorms,Sunny,Cloudy,Rainy

In [75]:
df.dtypes

Date          object
Temprature     int64
Wind Speed     int64
Event         object
dtype: object

In [76]:
df.shape

(8, 4)

In [77]:
df.axes

[RangeIndex(start=0, stop=8, step=1),
 Index(['Date', 'Temprature', 'Wind Speed', 'Event'], dtype='object')]

In [78]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        8 non-null      object
 1   Temprature  8 non-null      int64
 2   Wind Speed  8 non-null      int64
 3   Event       8 non-null      object
dtypes: int64(2), object(2)
memory usage: 384.0+ bytes

In [79]:
df.head()

         Date  Temprature  Wind Speed          Event
0  2023-09-01          25          10          Sunny
1  2023-09-02          22          15  Partly Cloudy
2  2023-09-03          28           8          Rainy
3  2023-09-06          19           5          Rainy
4  2023-09-07          27          18  Thunderstorms

In [80]:
df.head(2)

         Date  Temprature  Wind Speed          Event
0  2023-09-01          25          10          Sunny
1  2023-09-02          22          15  Partly Cloudy

In [81]:
df.tail()

         Date  Temprature  Wind Speed          Event
3  2023-09-06          19           5          Rainy
4  2023-09-07          27          18  Thunderstorms
5  2023-09-10          29           7          Sunny
6  2023-09-09          23          14         Cloudy
7  2023-09-11          19           5          Rainy

In [82]:
df.sum()

Date          2023-09-012023-09-022023-09-032023-09-062023-0...
Temprature                                                  192
Wind Speed                                                   82
Event         SunnyPartly CloudyRainyRainyThunderstormsSunny...
dtype: object

In [2]:

data={'Name':['anshu','babu','ravi','raja','sima'], 
    'Marks':[91,72,83,74,55]}
print(data)
df=pd.DataFrame(data)
df

{'Name': ['anshu', 'babu', 'ravi', 'raja', 'sima'], 'Marks': [91, 72, 83, 74, 55]}

    Name  Marks
0  anshu     91
1   babu     72
2   ravi     83
3   raja     74
4   sima     55

In [109]:
df['Marks'].sum()

375

In [111]:
df['Marks'].mean()

75.0

In [99]:
df['Marks'].std()

13.509256086106296

In [3]:
df.describe()

           Marks
count   5.000000
mean   75.000000
std    13.509256
min    55.000000
25%    72.000000
50%    74.000000
75%    83.000000
max    91.000000

In [113]:
df.describe(include=['object'])

         Name
count       5
unique      5
top     anshu
freq        1

In [4]:
df.describe(include=['number'])

           Marks
count   5.000000
mean   75.000000
std    13.509256
min    55.000000
25%    72.000000
50%    74.000000
75%    83.000000
max    91.000000

In [6]:
df.describe(include='all')

         Name      Marks
count       5   5.000000
unique      5        NaN
top     anshu        NaN
freq        1        NaN
mean      NaN  75.000000
std       NaN  13.509256
min       NaN  55.000000
25%       NaN  72.000000
50%       NaN  74.000000
75%       NaN  83.000000
max       NaN  91.000000